Repository: irdyansages/Towards_the_Light
Catalog: translations/wesnoth-Towards_the_Light/*.po
Languages: cs

source: heals +
cs: léčí +

source: female^heals +
cs: léčí +

source: This unit combines herbal remedies with magic to heal units more quickly than is normally possible on the battlefield. A unit cared for by this healer may heal up to
cs: Tato jednotka kombinuje účinky léčivých rostlin s magií, aby vyléčila jednotky rychleji než je běžně možné na bitevním poli. "" "Zraněná jednotka se může za jeden tah vyléčit až o

source: shield
cs: štít

source: female^shield
cs: štít

source: This unit's presence is so glorious that all adjacent allies are hounoured and inspired by them, increasing their resistances by
cs: Přítomnost této jednotky je tak povznášející, že všechny sousedící spojenecké jednotky jí poctěny a inspirovány, což zvyšuje jejich odolnost o

source: %, up to a maximum of 60%.
cs: %, až na maximum 60 %.

source: Adjacent allied units have their resistances increased by the sole presence of this unit.
cs: Odolnost sousedících spojeneckých jednotkem je pouhou přítomností této jednotky zvýšena.

source: Jolla will keep no experiences from this scenario
cs: Jolla nezíská z tohoto scénáře žádné zkušenosti

source: <i>From Journal of Jolla of Aldril</i> 5 VII, 556 YW: I have a strong feeling that something big is about to begin and I personally will play a role in it so I am going to keep notes about it. Sure, I am just some 14 years old girl who arrived on the Isle of Alduin a short time ago to study magical arts but my parents were pretty sure that I will manage to do something great in my life time and reminded me it at occasions. It was nice to hear at first but with time it started to become a bit frustrating as I did not want to disappoint them ... I meant to use the knowledge and abilities which I acquire here to help people in my home town who knows what will happen ...
cs: <i>Z deníku Jolly z Aldrilu</i> 5. VII. 556 w. l.: Mám silný pocit, že brzy začne něco velkého. A já osobně v tom budu mít nějakou roli, takže to hodlám zaznamenat. Jistě, jsem jen čtrnáctiletá dívka, která nedávno dorazila na ostrov Alduin studovat magická umění. Ale mí rodiče si byli docela jistí, že ve svém životě dokážu něco velkého a často mi to připomínali. Poprvé bylo hezké to slyšet, ale po čase to začalo být trochu nepříjemné, protože jsem je nechtěla zklamat... Měla jsem v úmyslu pomocí znalostí a schopností, které zde získám, pomáhat lidem v mém rodném městě. Ale kdo ví, co se stane...

source: 8 VII, 556 YW: I just returned from the breakfast. I was sitting with Clare, like always. She is my only real friend here. All apprentices are kind more or less but only Clare shares my desire to help people. I sometimes think that the others were forced to go here ... Anyway, one of our teachers asked me and a few other apprentices to meet with her outside in half a hour. I am very curious why. It may not be anything important but it might as well start something greater.
cs: 8. VII. 556 w. l.: Právě jsem se vrátila ze snídaně. Seděla jsem s Klárou, jako vždy. Ona je tu mou jedinou opravdovou kamarádkou. Všichni učedníci jsou víceméně milí, ale jen Klára sdílí mou touhu pomáhat lidem. Někdy si myslím, že ostatní sem byli donuceni jít... Každopádně jedna z našich učitelek mne a pár dalších učedníků požádala, abychom se ní za půl hodiny venku setkali. Jsem velmi zvědavá proč. Možná to není nic důležitého, ale stejně tak to může být začátek něčeho většího.

source: 8 VII, 556 YW later that day: Well, that was an interesting experience indeed but most important, we helped local people. They were really grateful and even invited us all to lunch.
cs: 8. VIII. 556 w. l.: No, to byla zajímavá zkušenost, ale nejdůležitější bylo, že jsme pomohli místním lidem. Byli nám velice vděční a dokonce nás pozvali na oběd.

source: 16 VII, 556 YW: Oh, that was a really hard week. I had almost no time to rest and keep a journal because we had to study a lot. But it was worth it as I learnt a lot of new things. They let us rest for today. After finishing the entry, I am going to read some poems and after that I will meet with Clare. We talk a lot and always she amazes me with her intellect. I firmly believe that she will be the greatest wizard of our generation.
cs: 16. VIII. 556 w. l.: Ó, to byl opravdu těžký týden. Neměla jsem téměř žádný čas na odpočinek a psaní deníku, protože jsme museli hodně studovat. Ale stálo to za to, neboť jsem se naučila spoustu nových věcí. Dnes nás nechali odpočinout. Až dokončím zápis, budu si číst nějaké básně a poté se setkám s Klárou. Hodně spolu mluvíme a vždy mne ohromuje svou inteligencí. Pevně věřím, že se stane největší čarodějkou z naší generace.

source: 16 VII, 556 YW later that day: It was a pleasant time with Clare, as always. We were mostly discussing the event of the last week. She agreed with me that it was hard but it is going to bring its fruits in the future. When we were about to return to our cells, we met one of our teachers who told us that we will be having a special lesson tomorrow. I and Clare are both eager to know what kind of lesson it is going to be.
cs: 16. VIII. 556 w. l., později toho dne: S Klárou mi bylo jako vždy příjemně. Většinou jsme diskutovaly o události z minulého týdne. Souhlasila se mnou, že to bylo těžké, ale v budoucnu to přinese své ovoce. Když jsme se chystaly vrátit do svých pokojů, potkaly jsme jednoho z našich učitelů, který nám řekl, že zítra budeme mít speciální lekci. Jsme s Klárou dychtivé vědět, jaký druh lekce to bude.

source: team_name^Students
cs: Studenti

source: Clare
cs: Klára

source: team_name^Animals
cs: Zvířata

source: team_name^Teacher
cs: Učitel

source: Calm all animals (by reducing their hp to 0)
cs: Uklidni všechna zvířata (snížením jejich životů na 0)

source: Jolla or Clare gets exhausted
cs: Jolla nebo Klára se vyčerpají

source: So, they finally let us leave the walls of the academy but why? Will we have a lesson under the open sky?
cs: Tak konečně nás nechali opustit zdi akademie. Ale proč? Budeme mít hodinu venku?

source: Sort of. Well, I'm not going to teach you some theory as you would expect, this will rather be practical lesson, an exercise.
cs: Tak trochu. No, nebudu vás učit nějakou teorii, jak byste očekávali, bude to spíše praktická lekce, cvičení.

source: Exercise, you say? All I can see around are animals. But we aren't here to become some farmers, we train to be mages.
cs: Cvičení, říkáte? Vidím kolem jen zvířata. Ale my tu nejsme, abychom se stali nějakými farmáři, trénujeme, abychom se stali mágy.

source: Sure, we want to test your magical abilities here. These animals gone wild and no one else is able to calm them. Using magic is our last hope.
cs: Jistě, chceme tu otestovat vaše magické dovednosti. Tato zvířata zdivočela a nikdo je nedokáže uklidnit. Použití magie je naše poslední naděje.

source: Maybe but should WE care? We never get to eat them in the Academy. Our food is ... well, it only saves us from dying from hunger. It doesn't taste really well.
cs: Možná, ale proč by NÁS to mělo zajímat? V Akademii se nevaří z jejich masa. Naším jídlem je... no, něco co zajišťuje, abychom neumřeli hlady. Nechutná to nijak zvlášť dobře.

source: Cannot you do it just because it is right? It will fill your soul with a good feeling.
cs: Nemůžeš to udělat prostě proto, že je to správné? Naplní to tvou duši dobrým pocitem.

source: I will gladly help you with it, my friend.
cs: Já ti s tím ráda pomohu, kamarádko.

source: Thank you, Clare. So what about you?
cs: Děkuji, Kláro. A co ty?

source: Fine, fine! I'll do it.
cs: Fajn, fajn! Udělám to.

source: Excellent. Let us start then.
cs: Výborně. Začněme tedy.

source: Go to the infirmary.
cs: Jdi na ošetřovnu.

source: Oh, uh ...
cs: Uf, uf...

source: The other apprentices eventually accomplished their task but Jolla never got a chance to fulfil her destiny. After completing her studies, she returned to her home town where she helped other citizens until a disease struck her at the age of 33.
cs: Ostatní učedníci nakonec splnili svůj úkol, ale Jolla nikdy nedostala šanci svůj osud naplnit. Poté co dokončila studia se vrátila do svého rodného města, kde pomáhala ostatním občanům, dokud jí v jejích 33 letech neskolila nemoc.

source: Oh, oh ...
cs: Uf, uf...

source: No! I cannot complete our task without you.
cs: Ne! Nemohu dokončit náš úkol bez tebe.

source: I am sorry, Jolla.
cs: Je mi to líto, Jollo.

source: team_name^Student
cs: Student

source: Find a way back to the Academy
cs: Najdi cestu zpět do Akademie

source: Jolla gets exhausted
cs: Jolla se vyčerpá

source: Ram
cs: Beran

source: Horns
cs: rohy

source: Tusklet
cs: Lončák

source: Young tuskers are as notoriously bad-tempered as the adults of the species, if a little less of a challenge. But woe betide the unfortunate who comes between a Tusklet and its parents.
cs: Mladí lončáci bývají stejně notoricky špatně naladěni jako dospělí tohoto druhu. Představují však pro protivníka menší výzvu. Ale běda nešťastníkovi, který vleze mezi lončáka a jeho rodiče.

source: Tusks
cs: kly

source: Apprentice Mage
cs: Mág učedník

source: There are many academies dedicated to the study of magic, and the training of new mages. Apprentices must study hard if they ever hope to become magi.
cs: Je mnoho akademií, která se se zaměřují na studium magie a trénování nových mágů. Učedníci musí tvrdě studovat, pokud se opravdu chtějí stát mágy.

source: magic puff
cs: magický obláček

source: female^Apprentice Mage
cs: Čarodějka učednice

source: Blacksmith
cs: Kovář

source: Blacksmiths are not soldiers, but their strength and dexterity with hammers make them rather good warriors.
cs: Kováři nejsou vojáci, ale jejich síla a obratnost s kladivy z nich dělá poměrně dobré válečníky.

source: dexterity 50%
cs: obratnost 50 %

source: This attack always has a 50% chance to hit regardless of the defensive ability of the unit being attacked.
cs: Tento útok má vždy 50% šanci zásahu bez ohledu na obranné možnosti cílové jednotky.

source: Old Blacksmith
cs: Starý kovář

source: dexterity 60%
cs: obratnost 60 %

source: This attack always has a 60% chance to hit regardless of the defensive ability of the unit being attacked.
cs: Tento útok má vždy 60% šanci zásahu bez ohledu na obranné možnosti cílové jednotky.

source: Young Blacksmith
cs: Mladý kovář

source: Worker
cs: Dělník

source: Workers are some kind of peasants skilled at many things.
cs: Dělníci patří mezi prostý lid a jsou nadaní v mnoha věcech.

source: female^Crusader
cs: Křižačka

source: better with morning star
cs: lepší s řemdihem

source: more precise with morning star
cs: přesnější s řemdihem

source: better with lightbeam
cs: lepší s paprskem světla

source: female^able to heal allies more
cs: schopná více léčit spojence

source: more healthy
cs: zdravější

source: female^able to unleash (and control) her anger in battle
cs: schopná uvolnit (a kontrolovat) svůj hněv v bitvě

source: divine rage
cs: svatý hněv

source: Whether used offensively or defensively, this attack presses the engagement until one of the combatants is slain, or 3 rounds of attacks have occurred.
cs: Ať už se použije ofenzivně nebo defenzivně, boj trvá tak dlouho, dokud jeden z protivníků nezemře, nebo do počtu 3 útoků.

source: burning light
cs: spalující světlo

source: This attack does more damage on chaotic units.
cs: Tento útok působí chaotickým jednotkám větší škodu.

source: scourge
cs: metla

source: This attack causes its targets to take small but continuous damage. Affected units lose 4 HP every turn until they are cured. This curse can kill its targets.
cs: Tento útok způsobí, že jeho cíle budou trpět malé, ale neustálé poškození. Ovlivněné jednotky ztrácí každé kolo 4 životy, dokud nejsou vyléčeny. Tato kletba může své cíle zabít.

source: female^able to better control her anger in battle
cs: schopná lépe kontrolovat svůj hněv v bitvě

source: faster
cs: rychlejší

source: female^able to make allies resist damage better (20% to resistances)
cs: schopná učinit spojence odolnější vůči poškození (20 % k odolnostem)

source: female^able to make allies resist damage better (25% to resistances)
cs: schopná učinit spojence odolnější vůči poškození (25 % k odolnostem)

source: female^better protected from arcane damage (10% better resistance)
cs: lépe chráněná proti poškození nezemským útokem (o 10 % vyšší odolnost)

source: female^Adept of Light
cs: Adeptka Světla

source: Certain female mage apprentices are chosen from admission into the academies to study the magic of light. After graduation, they become Adepts. These magi can summon the Light in the form of energy balls and are able slightly heal wounded allies.
cs: Některé čarodějky učednice jsou k přijetí na akademie vybrány proto, aby studovaly magii světla. Po ukončení studia se stávají adeptkami. Tyto magyně dovedou přivolat Světlo ve formě energetických koulí a jsou schopny zraněné spojence snadno uzdravit.

source: aura blast
cs: výbuch aury

source: Towards the Light
cs: Vstříc Světlu

source: TtL
cs: VS

source: female^Apprentice
cs: Učednice

source: Easy
cs: Snadná

source: female^Cleric
cs: Kněžka

source: Normal
cs: Normální

source: Hard
cs: Těžká

source: Campaign Design:
cs: Návrh tažení:
